var str = prompt('Введите свое имя');
console.log('Меня зовут ' + str);
var niger = prompt('Введите совй возрост');
console.log('Мне ' + niger);
var str = +prompt('Решите пример ' + '10 + 3 = ?');
console.log('Пример 1: ' + ('10 + 3 = 13 ')   + 'Ваш ответ ' + str );
var str = +prompt('Решите пример ' + '10 - 5 = ?');
console.log('Пример 2: ' + ('10 - 5 = 5 ')   + 'Ваш ответ ' + str );
var str = +prompt('Решите пример ' + '10 * 5 = ?');
console.log('Пример 3: ' + ('10 * 5 = 50 ')   + 'Ваш ответ ' + str );
var str = +prompt('Решите пример ' + '10 / 5 = ?');
console.log('Пример 4: ' + ('10 / 5 = 2 ')   + 'Ваш ответ ' + str );
var str = +prompt('Решите пример ' + '10 % 10 = ?');
console.log('Пример 4: ' + ('10 % 10 = 1 ')   + 'Ваш ответ ' + str );
  

alert('Откройте консоль для просмотра');